/**
 * Created by AprileLemon on 2017/4/12.
 */
export const errorCode = code => {
  let result = ''
  let errorString = '[{"100000":"请求成功"},{"100007":"参数为空"},{"100010":"token生成失败"},{"100011":"校验token失败"},{"100012":"请求内容异常"},{"100013":"数据库内容异常"},{"100050":"密码错误"},{"100051":"用户新增失败"},{"100052":"角色新增失败"},{"100053":"子系统信息新增失败"},{"100054":"管理员新增失败"},{"100055":"模块新增失败"},{"100056":"组织新增失败"},{"100057":"无权限删除管理员"},{"100058":"批量删除子系统信息失败"},{"100059":"用户删除失败"},{"100060":"批量删除组织失败"},{"100061":"普通管理员激活失败"},{"100062":"用户激活失败"},{"100063":"组织更新失败"},{"100064":"更新子系统信息失败"},{"100065":"用户明细更新失败"},{"100066":"模块更新失败"},{"100067":"当前用户无授权角色"},{"100068":"根据用户授权角色信息的记录查无角色信息"},{"100069":"根据权限Id查无权限"},{"100070":"根据角色Id查无角色信息"},{"100071":"查询子系统列表失败"},{"100072":"模块不存在"},{"100073":"用户不存在"},{"100074":"管理员用户不存在"},{"100075":"该用户未激活"},{"100076":"组织不存在"},{"100077":"该子系统信息不存在"},{"100078":"校验密码异常"},{"100079":"无权限进行激活"},{"100080":"账号长度为6-11位"},{"100081":"密码长度为8-16位"},{"100082":"组织名称长度为30个字以内"},{"100083":"管理员名字长度为1-9个字"},{"100084":"密码编译失败"},{"100085":"模块名重复"},{"100086":"当前用户与角色关系信息已存在"},{"100087":"当前权限与角色关系信息已存在"},{"100088":"当前权限已存在,不可重复添加"},{"100089":"当前角色已存在,不可重复添加"},{"100090":"用户名已存在"},{"100091":"账号已存在"},{"100092":"组织名已存在"},{"100093":"生成验证码失败"},{"100094":"验证码错误"},{"100095":"当前子系统编码subCode已存在"},{"100096":"用户无需激活"},{"100097":"管理员无需激活"},{"100098":"用户添加角色失败"},{"100099":"用户信息不存在"},{"100100":"帐号未绑定人员，请联系管理员绑定"},{"100110":"用户未绑定工种"},{"200091":"人员类型请求失败"},{"200050":"新增培训计划失败"},{"200051":"name转json格式错误"},{"200052":"组织不存在"},{"200053":"人员不存在"},{"200054":"人员信息不存在"},{"200055":"主题长度为0-50个字"},{"200056":"保底库存数量不能小于0"},{"200057":"备注长度为0-50个字"},{"200058":"修改培训计划失败"},{"200059":"删除培训计划失败"},{"200060":"培训登记失败"},{"200061":"删除培训记录失败"},{"200062":"出库数量大于库存数量"},{"200063":"事件内容在0-30个字内"},{"200064":"奖惩分值不能小于0"},{"200065":"材料单位长度为0-10个字"},{"200066":"材料名称长度为0-15个字"},{"200067":"材料纯度长度为0-10个字"},{"200068":"材料规格长度为0-15个字"},{"200069":"人员不存在"},{"200070":"人员修改失败"},{"200071":"获取人员总数失败"},{"200072":"删除材料类型失败"},{"200073":"修改材料类型失败"},{"200074":"修改材料类型获取失败"},{"200075":"登记材料已存在"},{"200076":"材料信息不存在"},{"200086":"下载失败"},{"200077":"上传失败"},{"200078":"新增材料类型失败"},{"200079":"入库数量应大于0"},{"200080":"新增入库失败"},{"200081":"获取人员失败"},{"200082":"入库信息备注字段最大长度为20个字以内容为字母、汉字或标点符号"},{"200083":"类型被引用，不能删除"},{"200084":"入库数已超出申请数"},{"ublic static final int CODE_200091_1 = 200091":"人员类型请求失败"},{"200050":"新增培训计划失败"},{"200051":"name转json格式错误"},{"200052":"组织不存在"},{"200053":"人员不存在"},{"200054":"人员信息不存在"},{"200055":"主题长度为0-50个字"},{"200056":"保底库存数量不能小于0"},{"200057":"备注长度为0-50个字"},{"200058":"修改培训计划失败"},{"200059":"删除培训计划失败"},{"200060":"培训登记失败"},{"200061":"删除培训记录失败"},{"200062":"出库数量大于库存数量"},{"200063":"事件内容在0-30个字内"},{"200064":"奖惩分值不能小于0"},{"200065":"材料单位长度为0-10个字"},{"200066":"材料名称长度为0-15个字"},{"200067":"材料纯度长度为0-10个字"},{"200068":"材料规格长度为0-15个字"},{"200069":"人员不存在"},{"200070":"人员修改失败"},{"200071":"获取人员总数失败"},{"200072":"删除材料类型失败"},{"200073":"修改材料类型失败"},{"200074":"修改材料类型获取失败"},{"200075":"登记材料已存在"},{"200076":"材料信息不存在"},{"200086":"下载失败"},{"200077":"上传失败"},{"200078":"新增材料类型失败"},{"200079":"入库数量应大于0"},{"200080":"新增入库失败"},{"200081":"获取人员失败"},{"200082":"入库信息备注字段最大长度为20个字以内容为字母、汉字或标点符号"},{"200083":"类型被引用,不能删除"},{"200084":"入库数已超出申请数"},{"200100":"仪器新增失败"},{"200101":"仪器修改失败"},{"200105":"维修修改失败"},{"200111":"仪器报废失败"},{"200112":"获取出厂编号失败"},{"200113":"字符串长度过长"},{"200115":"文件不存在"},{"200114":"获取权限信息列表失败"},{"200116":"byte转文件失败"},{"400050":"机台名称重复"},{"400051":"机台编号重复"},{"400052":"机台卷绕头数或者锭数有误"},{"400053":"该车间的该位号已有机台"},{"400054":"丝车编号重复"},{"400055":"丝车规格有误"},{"400056":"叉车编号重复"},{"400057":"计划无需执行"},{"400058":"批次不存在"},{"400059":"人员编号重复"},{"400060":"班组名称重复"},{"400061":"车间名称重复"},{"400062":"工作类型名字重复"},{"400063":"工作类型编码重复"},{"400064":"职位名字重复"},{"400065":"职位编码重复"},{"400066":"叉车类型名称重复"},{"400067":"线别名重复"},{"400068":"降等原因类型名称重复"},{"400069":"降等原因名称重复"},{"400070":"纸管相关信息重复"},{"400071":"产品工艺名称重复"},{"400072":"丝锭名称重复"},{"400073":"批次号重复"},{"400074":"丝锭不存在"},{"400075":"丝车条码信息不存在"},{"400076":"丝锭条码信息不存在"},{"400077":"丝车信息不存在"},{"400078":"丝车锭位不存在"},{"400079":"落筒规则不存在"},{"400080":"员工信息不存在"},{"400081":"工种不存在"},{"400082":"规格已存在"},{"400083":"丝车已绑定丝锭"},{"400084":"改丝锭重量已经存在"},{"400085":"丝锭异常信息已存在"},{"400086":"车间不存在"},{"400087":"打印机编码重复"},{"400088":"产品类型名已存在"},{"400089":"导出统计报表失败"},{"400090":"模板文件不存在"},{"400091":"模板文件格式错误"},{"400092":"异常等级名重复"},{"400093":"丝锭编码重复"},{"400094":"丝锭异常信息不存在"},{"400095":"异常等级信息等级重复"},{"400096":"丝锭异常等级不存在"},{"400097":"丝锭等级不存在"},{"400098":"丝锭未绑定丝车"},{"400099":"丝车无空闲锭位"},{"400100":"未维护打印机"},{"400101":"当前没有可用打印机"},{"400102":"redis服务异常"},{"400103":"降等拼车丝锭数量不足"},{"400104":"丝锭尚未解绑"},{"400105":"报表筛选参数错误"},{"400106":"丝车条码重复"},{"400107":"降等原因等级重复"},{"400135":"丝车编号规则错误"},{"400139":"输入批号错误"},{"400142":"姓名重复"},{"400143":"工号重复"}]'
  let errorObj = JSON.parse(errorString)
  for (let item of errorObj) {
    for (let key in item) {
      if (Number(key) === code) {
        result = item[key]
      }
    }
  }
  if (!result) {
    result = '未知错误, 错误代码：' + code
  }
  // switch (code) {
  //   case 100000:
  //     // 请求成功正确请求以及正确返回的情况下
  //     result = '请求成功'
  //     break
  //   case 100007:
  //     result = '参数为空'
  //     break
  //   case 100010:
  //     result = 'token生成失败 '
  //     break
  //   case 100011:
  //     result = '校验token失败'
  //     break
  //   case 100012:
  //     result = '请求内容异常'
  //     break
  //   case 100050:
  //     result = '密码错误'
  //     break
  //   case 100051:
  //     result = '用户新增失败'
  //     break
  //   case 100052:
  //     result = '角色新增失败'
  //     break
  //   case 100053:
  //     result = '子系统信息新增失败'
  //     break
  //   case 100054:
  //     result = '管理员新增失败'
  //     break
  //   case 100055:
  //     result = '模块新增失败'
  //     break
  //   case 100056:
  //     result = '组织新增失败'
  //     break
  //   case 100057:
  //     result = '无权限删除管理员'
  //     break
  //   case 100058:
  //     result = '批量删除子系统信息失败'
  //     break
  //   case 100059:
  //     result = '用户删除失败'
  //     break
  //   case 100060:
  //     result = '批量删除组织失败'
  //     break
  //   case 100061:
  //     result = '普通管理员激活失败'
  //     break
  //   case 100062:
  //     result = '用户激活失败'
  //     break
  //   case 100063:
  //     result = '组织更新失败'
  //     break
  //   case 100064:
  //     result = '更新子系统信息失败'
  //     break
  //   case 100065:
  //     result = '用户明细更新失败'
  //     break
  //   case 100066:
  //     result = '模块更新失败'
  //     break
  //   case 100067:
  //     result = '当前用户无授权角色'
  //     break
  //   case 100068:
  //     result = '根据用户授权角色信息的记录查无角色信息'
  //     break
  //   case 100069:
  //     result = '根据权限Id查无权限'
  //     break
  //   case 100070:
  //     result = '根据角色Id查无角色信息'
  //     break
  //   case 100071:
  //     result = '查询子系统列表失败'
  //     break
  //   case 100072:
  //     result = '模块不存在'
  //     break
  //   case 100073:
  //     result = '用户不存在'
  //     break
  //   case 100074:
  //     result = '管理员用户不存在'
  //     break
  //   case 100075:
  //     result = '该用户未激活'
  //     break
  //   case 100076:
  //     result = '组织不存在'
  //     break
  //   case 100077:
  //     result = '该子系统信息不存在'
  //     break
  //   case 100078:
  //     result = '校验密码异常'
  //     break
  //   case 100079:
  //     result = '无权限进行激活'
  //     break
  //   case 100080:
  //     result = '账号长度为6-11位'
  //     break
  //   case 100081:
  //     result = '密码长度为8-16位'
  //     break
  //   case 100082:
  //     result = '组织名称长度为30个字以内'
  //     break
  //   case 100083:
  //     result = '管理员名字长度为1-9个字'
  //     break
  //   case 100084:
  //     result = '密码编译失败'
  //     break
  //   case 100085:
  //     result = '模块名重复'
  //     break
  //   case 100086:
  //     result = '组织名称长度为30个字以内'
  //     break
  //   case 100087:
  //     result = '当前权限与角色关系信息已存在'
  //     break
  //   case 100088:
  //     result = '当前权限已存在,不可重复添加'
  //     break
  //   case 100089:
  //     result = '当前角色已存在,不可重复添加'
  //     break
  //   case 100090:
  //     result = '用户名已存在'
  //     break
  //   case 100091:
  //     result = '账号已存在'
  //     break
  //   case 100092:
  //     result = '组织名已存在'
  //     break
  //   case 100093:
  //     result = '生成验证码失败'
  //     break
  //   case 100094:
  //     result = '验证码错误'
  //     break
  //   case 100095:
  //     result = '当前子系统编码subCode已存在'
  //     break
  //   default:
  //     result = '未知错误, 错误代码：' + code
  // }
  return result
}
